 #數字運算 除數有正數除法和小數除法,例如3/6 =0.5, 但3//6 (雙斜線)=0
# x=3//6
# print(x)
# x=3**3 #** 乖次方
# print(x)
# x=2**0.5 #** 乖次方,如要開根號便加0.5
# print(x)
# x=7%3 # %這個代表餘數7/3 餘1,所以答案是1
# print(x)
# x/=1 #上面答案是1 再加上這個+1,答案是2. 這是將變數中的數字+1 ,x=x+1
#       #也可以這表逹x+=1 這變成X+1
#       #也可以這表逹x-=1 這變成X-1
#       #也可以這表逹x*=1 這變成X*1
#       #也可以這表逹x/=1 這變成X*1
# print (x) 
 #字串運算 
s='hello' 'world' #如果想在雙引號中用雙引號可以\" , Python 也可以接受空格作為字串連結,+ 也可以
print (s)

s='hello\nworld' #如果想在雙引號中用雙引號可以\" , 可加N 變隔行
print (s)

s='''hello 

world''' #如果加入三對的單.雙引號便會按照所輸入的換
print (s)

s='hello' #直接表示字串那個位置開始到結束,而且字串永遠由左到右,0開始,例如下面S從1的位置即是e 開始,但冒號後沒結束,所以全顯示出來
print (s[1:])
